import 'package:manty_nomer_1/core/images/app_images.dart';
import 'package:manty_nomer_1/features/menu/data/models/manty_model.dart';

List<MantyModel> mantyData = [
  MantyModel(
    id: 1,
    title: 'Манты с мясом',
    description:
        'Манты с мясом - это один из видов мантов, начиненных мелко нарезанным мясом, обычно бараниной. Начинка также может содержать лук и различные специи, такие как кумин, кориандр и черный перец. Готовятся манты с мясом в пароварке, после чего они подаются горячими с соусом из томатов, топленым маслом или сметаной. Это национальное блюдо во многих странах Центральной Азии и на Кавказе, и считается одним из самых популярных и любимых блюд в регионе.',
    image: AppImages.manyImage,
    price: 140,
  ),
  MantyModel(
    id: 2,
    title: 'Манты с картошкой',
    description:
        'Манты с картошкой - это другой вид мантов, который содержит начинку из картофеля, который обычно нарезается на кубики или терется на терке. Картофель может быть приправлен луком, зеленым луком, топленым маслом и специями, такими как чеснок и кумин. Манты с картошкой готовятся также в пароварке, и подаются горячими с соусом из томатов или сметаной. Они также популярны во многих странах Центральной Азии и на Кавказе, и являются одним из вегетарианских вариантов этого блюда.',
    image: AppImages.manyImage,
    price: 80,
  ),
  MantyModel(
    id: 3,
    title: 'Манты с тыквой',
    description:
        'Манты с тыквой - это еще один вариант мантов, который содержит начинку из тыквы, которая обычно нарезается на кубики или терется на терке. Тыква может быть приправлена специями, такими как кориандр, кумин и куркума, а также добавлена лук, чеснок и зелень. Манты с тыквой готовятся в пароварке, и подаются горячими с соусом из томатов или сметаной. Этот вариант мантов также является вегетарианским и популярным во многих странах Центральной Азии и на Кавказе.',
    image: AppImages.manyImage,
    price: 90,
  ),
  MantyModel(
    id: 4,
    title: 'Манты с жусаем',
    description:
        'Манты с жусям - это вид мантов, содержащих начинку из куриного мяса, которое может быть нарезано на мелкие кусочки или мелко измельчено. Жусай (курут) - это специфический продукт, изготавливаемый из кисломолочного продукта, обезвоженного до твёрдого состояния. В манты с жусям жусай добавляется в качестве дополнительного ингредиента. Манты готовятся в пароварке и подаются горячими с соусом из томатов, топленым маслом или сметаной. Это национальное блюдо во многих странах Центральной Азии и на Кавказе, и является одним из любимых блюд местной кухни.',
    image: AppImages.manyImage,
    price: 100,
  ),
  MantyModel(
    id: 5,
    title: 'Оромо с тыквой',
    description:
        'Оромо с тыквой - это традиционное эфиопское блюдо, состоящее из тонко нарезанной тыквы, которая тушится с пряностями, луком и томатами. К тыкве добавляются обжаренные кусочки мяса и картофель, а все это подается на гречневой каше или с инжиром. Это блюдо обладает богатым вкусом и является отличным источником питательных веществ',
    image: AppImages.manyImage,
    price: 120,
  ),
  MantyModel(
    id: 6,
    title: 'Оромо с жусаем',
    description:
        'Оромо с жусаем - это традиционное эфиопское блюдо, состоящее из тонко нарезанной тыквы, которая тушится с пряностями, луком и томатами. К тыкве добавляются обжаренные кусочки мяса и картофель, а все это подается на гречневой каше или с инжиром. Это блюдо обладает богатым вкусом и является отличным источником питательных веществ',
    image: AppImages.manyImage,
    price: 100,
  ),
  MantyModel(
    id: 7,
    title: 'Пельмени обычные',
    description:
        'Пельмени - это традиционное блюдо русской кухни, состоящее из небольших круглых кусочков теста, которые начиняются фаршем из мяса, рыбы или овощей. Пельмени обычно варятся в подсоленной воде и подаются горячими с сметаной, соусом или маслом. Изначально пельмени были приготовлены как удобный способ хранения мяса в холодные зимние месяцы, но с течением времени стали одним из самых популярных блюд в России и за ее пределами.',
    image: AppImages.manyImage,
    price: 150,
  ),
  MantyModel(
    id: 8,
    title: 'Пельмени жареные',
    description:
        'Пельмени жареные - это вариант приготовления пельменей, при котором они жарятся на сковороде вместо того, чтобы вариться в воде. Для жарки пельменей обычно используется растительное масло и жарят их до золотистой корочки на среднем огне. Жареные пельмени имеют более насыщенный вкус и хрустящую текстуру по сравнению с вареными. Они могут подаваться с соусом, зеленью или сметаной.',
    image: AppImages.manyImage,
    price: 170,
  ),
];
